jmeter/results/rapport-html/statistics.json
{
  "GET /api/boats/1" : {
    "transaction" : "GET /api/boats/1",
    "sampleCount" : 1500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 23.214000000000002,
    "medianResTime" : 15.0,
    "minResTime" : 4.0,
    "maxResTime" : 157.0,
    "pct1ResTime" : 50.0,
    "pct2ResTime" : 68.95000000000005,
    "pct3ResTime" : 117.99000000000001,
    "throughput" : 20.355267264659183,
    "receivedKBytesPerSec" : 35.542204950401,
    "sentKBytesPerSec" : 2.544408408082398
  },
  "GET /api/boats" : {
    "transaction" : "GET /api/boats",
    "sampleCount" : 1500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 38.329999999999906,
    "medianResTime" : 26.0,
    "minResTime" : 7.0,
    "maxResTime" : 321.0,
    "pct1ResTime" : 77.0,
    "pct2ResTime" : 104.95000000000005,
    "pct3ResTime" : 172.95000000000005,
    "throughput" : 20.539504313295907,
    "receivedKBytesPerSec" : 346.02245010612074,
    "sentKBytesPerSec" : 2.527321819800082
  },
  "GET /api/articles" : {
    "transaction" : "GET /api/articles",
    "sampleCount" : 1500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 18.162666666666638,
    "medianResTime" : 9.0,
    "minResTime" : 2.0,
    "maxResTime" : 165.0,
    "pct1ResTime" : 44.0,
    "pct2ResTime" : 64.95000000000005,
    "pct3ResTime" : 113.95000000000005,
    "throughput" : 20.29605174140124,
    "receivedKBytesPerSec" : 184.5672205233675,
    "sentKBytesPerSec" : 2.556826830703867
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 4500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 26.56888888888893,
    "medianResTime" : 17.0,
    "minResTime" : 2.0,
    "maxResTime" : 321.0,
    "pct1ResTime" : 60.0,
    "pct2ResTime" : 81.0,
    "pct3ResTime" : 134.98999999999978,
    "throughput" : 58.32112909705932,
    "receivedKBytesPerSec" : 538.2364358823986,
    "sentKBytesPerSec" : 7.271156394587798
  }
}